tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "modem-dev/tap"
tap "sst/tap"
brew "abduco"
brew "apache-arrow-glib"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "carapace"
brew "cloc"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "csvkit"
brew "dasel"
brew "difftastic"
brew "docker-machine"
brew "dos2unix"
brew "dtach"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "forgecode"
brew "fzf"
brew "jpeg-turbo"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "goreleaser"
brew "grc"
brew "helm"
brew "hey"
brew "html2markdown"
brew "httpie"
brew "httpyac"
brew "hugo"
brew "modem-dev/tap/hunk"
brew "hyperfine"
brew "imagemagick"
brew "jd"
brew "jj"
brew "jq"
brew "lazygit"
brew "lefthook"
brew "librsvg"
brew "luarocks"
brew "macvim"
brew "mage"
brew "memcached"
brew "mise"
brew "multitail"
brew "neovim"
brew "notify"
brew "nushell"
brew "opencode"
brew "parquet-cli"
brew "podman"
brew "postgresql@18"
brew "prettier"
brew "pstree"
brew "pyenv"
brew "pyright"
brew "python-yq"
brew "python@3.12"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "sloccount"
brew "sqlfluff"
brew "starship"
brew "tesseract"
brew "tfk8s"
brew "tmate"
brew "tmux"
brew "tree-sitter-cli"
brew "universal-ctags"
brew "uv"
brew "wget"
brew "wimlib"
brew "worktrunk"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
cask "espanso"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-zed-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "jordanbaird-ice"
cask "lm-studio"
cask "notunes"
cask "openvpn-connect"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "anweber.vscode-httpyac"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ban.spellright"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "davidhouchin.whitespace-plus"
vscode "dorzey.vscode-sqlfluff"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nnutter.open-in-idea"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "sqlfluff.vscode-sqlfluff"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "code.cbbapps.com/infrastructure/cloud-applications/dataflow-pipeline/applications/cb"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/google/go-containerregistry/cmd/gcrane"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/nnutter/git-wt"
go "github.com/abice/go-enum"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/99designs/gqlgen"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/AlexanderGrooff/mermaid-ascii"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "github.com/oklog/ulid/v2/cmd/ulid"
cargo "rustlings"
cargo "worktrunk"
uv "keyring", with: ["keyrings-google-artifactregistry-auth"]
npm "neovim"
cask "anki"
cask "gimp"
brew "gopls"
brew "pandoc"
brew "lazydocker"
brew "typescript"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "go-air"
brew "govulncheck"
cask "waterfox"
brew "cargo-generate"
