tap "hashicorp/tap"
tap "modem-dev/tap"

brew "awscli"
brew "bat"
brew "carapace"
brew "cargo-generate"
brew "cloc"
brew "coreutils"
brew "csvkit"
brew "difftastic"
brew "dos2unix"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "git"
brew "gnu-sed"
brew "go-air"
brew "go"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "govulncheck"
brew "grc"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "helm"
brew "hey"
brew "html2markdown"
brew "httpie"
brew "httpyac"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jd"
brew "jj"
brew "jq"
brew "lefthook"
brew "mise"
brew "modem-dev/tap/hunk"
brew "multitail"
brew "neovim"
brew "notify"
brew "nushell"
brew "opencode"
brew "pandoc"
brew "parquet-cli"
brew "podman"
brew "postgresql@18"
brew "prettier"
brew "pstree"
brew "pyenv"
brew "pyright"
brew "python-yq"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "sloccount"
brew "sqlfluff"
brew "starship"
brew "tesseract"
brew "tfk8s"
brew "tmate"
brew "tmux"
brew "tree-sitter-cli"
brew "typescript"
brew "uv"
brew "wget"
brew "worktrunk"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "anki"
cask "chatgpt"
cask "chatgpt-atlas"
cask "codex-app"
cask "cyberduck"
cask "daisydisk"
cask "espanso"
cask "fastmail"
cask "freecad"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-zed-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gimp"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitlangton-hex"
cask "lm-studio"
cask "maccy"
cask "notunes"
cask "opencode-desktop"
cask "openvpn-connect"
cask "podman-desktop"
cask "shapr3d"
cask "simplenote"
cask "visual-studio-code"
cask "waterfox"
cask "windows-app"
cask "zed"
cask "zoom"

cargo "rustlings"
cargo "savepoint"
cargo "worktrunk"

go "github.com/99designs/gqlgen"
go "github.com/abenz1267/gomvp"
go "github.com/abice/go-enum"
go "github.com/air-verse/air"
go "github.com/AlexanderGrooff/mermaid-ascii"
go "github.com/cweill/gotests/gotests"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/fatih/gomodifytags"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/google/go-containerregistry/cmd/gcrane"
go "github.com/haya14busa/goplay/cmd/goplay"
go "github.com/josharian/impl"
go "github.com/koron/iferr"
go "github.com/kyoh86/richgo"
go "github.com/nnutter/git-wt"
go "github.com/oklog/ulid/v2/cmd/ulid"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/segmentio/golines"
go "github.com/tmc/json-to-struct"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "go.uber.org/mock/mockgen"
go "golang.org/x/tools/cmd/callgraph"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "gotest.tools/gotestsum"

npm "neovim"

uv "keyring", with: ["keyrings-google-artifactregistry-auth"]
